// بيانات المنتجات الكاملة مع خيارات التخصيص المحدثة
const productsData = [
        
        {
        id: 1,
        name: "BMW M4 GT3",
        description: `لوحة فنية راقية بعنوان BMW M4 GT3 – [em1]أداء مصمم للسيطرة[/em1]

تجسّد هذه اللوحة سيارة السباق الأسطورية BMW M4 GT3 في مشهد أمامي مباشر يعكس القوة، الدقة، والديناميكية العالية. التكوين يركّز على تفاصيل التصميم العدواني للسيارة، مانحًا إحساسًا بالحركة حتى في لحظة الثبات.

تعتمد اللوحة على طباعة عالية الجودة تبرز الخطوط الحادة، الانعكاسات الدقيقة، وتوازن الألوان بشكل احترافي، ما يجعلها قطعة بصرية قوية دون تشويش. الإطار الأنيق يكمل العمل بأسلوب عصري يحافظ على نظافة المشهد وقوته.

[title]🔥 لماذا BMW M4 GT3 :[/title] 
[feature]حضور رياضي قوي[/feature]: تصميم يلفت الانتباه ويضيف طاقة واضحة للمكان. 
[feature]تفاصيل دقيقة[/feature]: إبراز احترافي لملامح السيارة وخطوطها الهندسية. 
[feature]طابع عصري[/feature]: قطعة تناسب المساحات الحديثة والذوق المتقدم. 
[feature]تشطيب عالي الجودة[/feature]: مطبوعة على خامات [em2]Premium[/em2] تضمن وضوح الألوان وثباتها. 
[feature]مرونة في الاستخدام[/feature]: مثالية للمنازل، المكاتب، صالات العرض، والمساحات التجارية.

[em3]💎 أكثر من لوحة سيارات[/em3]
BMW M4 GT3 ليست مجرد صورة لسيارة، بل [em4]تجسيد لشغف الأداء[/em4]. اختيار مثالي لعشاق السرعة، الهندسة، وروح السباقات الحديثة.

[offer]⏰ كمية محدودة متوفرة[/offer]

[cta]🛒 أضف BMW M4 GT3 إلى مساحتك الآن — ودع الأداء يتصدر المشهد.[/cta]`,  

        price: 429,
        images: [
            "images/bmw/20251113_105539_4.jpg",
            "images/bmw/1762981416589.png",
            "images/bmw/1762981436881.png",
            "images/bmw/1762981479109.png",
            "images/cdr/all3.png"
        ],
        tag: "الأكثر مبيعاً",
        category: "BMW",
        details: "هذه اللوحة الفنية تم رسمها بدقة عالية باستخدام ألوان زيتية على قماش فني عالي الجودة. تبرز اللوحة التفاصيل الدقيقة للسيارة من خلال استخدام الظلال والإضاءة المحترفة. الإطار الخشبي المصنوع يدوياً يضيف لمسة أنيقة وجمالية للعمل الفني.",
        specifications: [
            { name: "المادة", value: "   vn / fx / اختياري " },
            { name: "الحجم", value: "75 × 40 سم" },
            { name: "الإطار", value: "بدون / مخصص " },
            { name: "الوزن", value: "200~1300غ" },
            { name: "الوقت المتوقع للتوصيل", value: "2-7 أيام عمل" },
            { name: "الضمان", value: "سنة" }
        ],
        // إضافة خيارات التخصيص
        sizes: [
            { id: "s1", name: "متوسط (90×50 سم)", price: 100 },
            { id: "s2", name: "كبير (120×65 سم)", price: 200 }
        ],
        frames: [
            { 
           id: "f1", 
           name: "بدون إطار", 
           price: 0
            },
            { 
           id: "f2", 
           name: "إطار خشبي", 
           price: 90,
           thumbnail: "images/c/wood.jpeg"
            },
            { 
          id: "f3", 
          name: "إطار المنيوم ", 
          price: 180,
          thumbnail: "images/c/alm.jpeg"
            }
        ],
        addons: [
  { id: "a1", name: "توقيع البراند", price: 0, selected: false },
  { id: "a2", name: "شهادة أصالة", price: 50, selected: false },
  { id: "a3", name: "تغليف فاخر / مخصص", price: 150, selected: false }
]
}, 
        
  /*14*/
{
    id: 14,
    name: "Vibrant Lions",
    description: `انفجار لوني، حماس جماهيري صاخب، وروح لا تعرف المستحيل. عمل فني يجسّد نبض الملاعب وحيوية كرة القدم بأسلوب \"البوب آرت\" المعاصر الذي يضفي طاقة إيجابية على أي مكان.\n\nتجسّد لوحة Vibrant Lions صحب المدرجات المغربية ولحظات الحماس الخالص، حيث يظهر نجوم المنتخب (حكيمي، بونو، ورفاقهم) في تكوين ديناميكي مليء بالحركة. الألوان الجريئة والخطوط القوية تعكس العصر الجديد للكرة المغربية، محولةً اللحظة الرياضية إلى قطعة فنية عصرية تنبض بالحياة.\n\n[title]✨ لماذا Vibrant Lions :[/title] \n[feature]نمط بوب آرت عصري[/feature]: تصميم جريء يناسب الديكورات الحديثة والمساحات الإبداعية. \n[feature]طاقة بصرية مذهلة[/feature]: تناغم بين ألوان العلم المغربي وخلفية المدرجات المشتعلة بالحماس. \n[feature]دقة تفاعلية[/feature]: تعابير وجه حيوية تمنحك شعوراً بأنك في قلب الملعب. \n[feature]مثالية للجيل الجديد[/feature]: قطعة فنية تلائم غرف الألعاب (Gaming Rooms)، المكاتب الحديثة، والمساحات الشبابية. \n[feature]جودة طباعة استثنائية[/feature]: ألوان مشبعة ومقاومة للبهتان للحفاظ على حيوية اللوحة طويلاً.\n\n[em3]⚡ شرارة شغف لا تنطفئ[/em3]\nVibrant Lions ليست مجرد لوحة، بل هي [em4]جرعة يومية من الإلهام[/em4] تذكرك بأن الطموح المغربي لا سقف له.\n\n[offer]🌟 قطعة عصرية فريدة[/offer]\n\n[cta]🛒 احصل على لوحة Vibrant Lions الآن — وانقل حماس الملاعب إلى عالمك الخاص.[/cta]`,
    price: 479,
    images: [
        "images/ftbl/vbls.png",
        "images/ftbl/vbls1.png",
        "images/ftbl/vbls2.png",
        "images/ftbl/vbls3.png",
        "images/ftbl/vbls4.png",
        "images/cdr/all3.png"
    ],
    tag: "جديد",
    category: "FOOTBALL",
    details: "انفجار لوني، حماس جماهيري صاخب، وروح لا تعرف المستحيل. عمل فني يجسّد نبض الملاعب وحيوية كرة القدم بأسلوب \"البوب آرت\" المعاصر الذي يضفي طاقة إيجابية على أي مكان.\n\nتجسّد لوحة Vibrant Lions صحب المدرجات المغربية ولحظات الحماس الخالص، حيث يظهر نجوم المنتخب (حكيمي، بونو، ورفاقهم) في تكوين ديناميكي مليء بالحركة. الألوان الجريئة والخطوط القوية تعكس العصر الجديد للكرة المغربية، محولةً اللحظة الرياضية إلى قطعة فنية عصرية تنبض بالحياة.",
    specifications: [
        { name: "المادة", value: "قماش كانفس / اختياري" },
        { name: "الحجم", value: "60×45 سم / اختياري" },
        { name: "الألوان", value: "ألوان زاهية مقاومة للبهتان" },
        { name: "الوزن", value: "400-1200 غ" },
        { name: "وقت التصنيع", value: "2-3 أيام عمل" },
        { name: "الضمان", value: "سنة" }
    ],
    sizes: [
        { id: "s_1768078707708_sn1ouwdpy", name: "صغير (60×45 سم)", price: 0 },
        { id: "s_1768078707708_20zisfv0v", name: "متوسط (80×60 سم)", price: 75 },
        { id: "s_1768078707708_9y11ue1kw", name: "كبير (100×75 سم)", price: 149 }
    ],
    frames: [
        { 
            id: "f_1768078707708_dkh31rfd1", 
            name: "بدون إطار", 
            price: 0
        },
        { 
            id: "f_1768078707708_e6n9vm31s", 
            name: "اطار خشبي", 
            price: 65,
            thumbnail: "images/c/wood.jpeg"
        },
        { 
            id: "f_1768078707708_lnki8pn7e", 
            name: "اطار المنيوم", 
            price: 120,
            thumbnail: "images/c/alm.jpeg"
        }
    ],
    addons: [
        { id: "a_1768078707708_vti0u2m3z", name: "توقيع البراند", price: 0, selected: false },
        { id: "a_1768078707708_c0xankisi", name: "شهادة أصالة ورقية ممهورة", price: 50, selected: false },
        { id: "a_1768078707708_zdlxbvv1i", name: "تغليف فاخر هدايا", price: 120, selected: false },
        { id: "a_1768078707708_hucg3jdc4", name: "رسالة ورقية بخط اليد", price: 35, selected: false }
    ]
},

    {
        id: 2,
        name: "Panda | The Wise Gaze",
        description: `لوحة فنية راقية بعنوان THE WISE GAZE – [em1]هدوء القوة[/em1]

تقدّم لوحة THE WISE GAZE قراءة بصرية متوازنة تجمع بين السكون والتركيز. يظهر الباندا في لحظة تأمل عميق، بنظرة ثابتة تعكس الهدوء الداخلي والقوة الهادئة، ضمن تكوين بصري نظيف ومدروس.

الخلفية البرتقالية النابضة تضيف طاقة دافئة ومتزنة، بينما يعزز الإطار الذهبي الفاخر الإحساس بالقيمة والرقي دون مبالغة. العمل مصمم ليكون عنصر جذب بصري يلفت الانتباه بهدوء، ويمنح المساحة طابعًا معاصرًا ومُلهمًا في الوقت نفسه.

[title]🔥 لماذا THE WISE GAZE :[/title] 
[feature]حضور هادئ[/feature]: لوحة تضيف عمقًا بصريًا دون فرض سيطرة على المكان. 
[feature]رمزية متزنة[/feature]: تعبير بصري عن التأمل، الحكمة، والقوة الداخلية. 
[feature]تباين أنيق[/feature]: انسجام محسوب بين الخلفية الجريئة والعنصر الرئيسي. 
[feature]تشطيب فاخر[/feature]: مطبوعة على خامات [em2]عالية الجودة[/em2] مع إطار ذهبي يعزز الإحساس بالفخامة. 
[feature]مرونة في الاستخدام[/feature]: مناسبة للمكاتب، غرف المعيشة، والمساحات ذات الطابع العصري.

[em3]💎 أكثر من لوحة[/em3]
THE WISE GAZE ليست مجرد قطعة فنية، بل [em4]تجربة بصرية[/em4] تعكس التوازن بين الهدوء والقوة، وتمنح المكان شخصية واضحة وراقية.

[offer]⏰ إصدار محدود[/offer]

[cta]🛒 أضف THE WISE GAZE إلى مساحتك الآن — ودع الهدوء يصنع حضوره.[/cta]`,
        price: 549,
        images: [
            "images/some/20251011_004904_3.jpg",
            "images/some/1762939056813.png",
            "images/some/1762939062106.png",
            "images/some/1762939075086.png",
            "images/some/1762952133402.png",
            "images/some/1762952216495.png",
            "images/cdr/all3.png"
          
        ],
        category: "CARTOON",
        details: "panda",
        specifications: [
            { name: "المادة", value: "   vn / fx / اختياري " },
            { name: "الحجم", value: "70 × 50 سم / اختياري" },
            { name: "الإطار", value: "إختياري / بدون " },
            { name: "الوزن", value: "400~2.3 غ~كغ" },
            { name: "الوقت المتوقع للتوصيل", value: "2-4 أيام عمل" },
            
        ],
        // إضافة خيارات التخصيص
        sizes: [
            { id: "s1", name: "صغير (50×40 سم)", price: 0 },
            { id: "s2", name: "متوسط (70×50 سم)", price: 50 },
            { id: "s3", name: "كبير (120×90 سم)", price: 150 }
        ],
        frames: [
            { 
                id: "f1", 
                name: "بدون إطار", 
                price: 0,
                thumbnail: "images/frames/no-frame.jpg"
            },
            { 
                id: "f2", 
                name: "إطار خشبي", 
                price: 80,
                thumbnail: "images/c/wood.jpeg"
            },
            { 
                id: "f3", 
                name: "إطار ألمنيوم ذهبي", 
                price: 150,
                thumbnail: "images/c/alm.jpeg"
            }
        ],
        addons: [
            { id: "a1", name: "توقيع البراند", price: 20, selected: false },
            { id: "a2", name: "شهادة أصالة", price: 49, selected: false },
            { id: "a3", name: "تغليف فاخر / مخصص", price: 120, selected: false }
        ]
    },
    {
        id: 3,
        name: "WANTED | مطلوب ",
        description: `لوحة فنية مميّزة بعنوان WANTED – [em1]كلاسيكية قابلة للتخصيص[/em1]

تقدّم لوحة WANTED رؤية معاصرة لأسلوب الغرب الأمريكي الكلاسيكي، بلمسة فنية جريئة تجمع بين الطابع التراثي والتصميم الحديث. التكوين مستوحى من ملصقات "المطلوبين" الشهيرة، مع معالجة بصرية نظيفة تجعلها قطعة لافتة دون مبالغة.

تتميّز هذه اللوحة بإمكانية التخصيص الكامل، حيث يمكن إضافة الاسم، اللقب، أو أي شخصية تختارها، مع تحديد قيمة المكافأة وفق رغبتك. كما تتوفر بنسختين: مرآة عاكسة تضيف عمقًا بصريًا للمساحة، أو طباعة فنية عالية الجودة لمن يفضّل المظهر الكلاسيكي الأصيل.

[title]🔥 لماذا WANTED :[/title] 
[feature]تصميم أيقوني[/feature]: مستوحى من ملصقات الغرب الأمريكي بأسلوب عصري متوازن. 
[feature]تخصيص كامل[/feature]: الاسم، اللقب، وقيمة المكافأة حسب اختيارك. 
[feature]خيار المرآة[/feature]: نسخة عاكسة تضيف اتساعًا وأناقة للمكان. 
[feature]طباعة احترافية[/feature]: خامات [em2]عالية الجودة[/em2] تضمن وضوح التفاصيل وثباتها. 
[feature]قطعة جريئة[/feature]: مثالية للمنازل، المكاتب، المقاهي، والمساحات ذات الطابع الإبداعي.

[em3]💎 أكثر من ديكور[/em3]
WANTED ليست مجرد لوحة، بل [em4]قطعة شخصية[/em4] تعكس روح الجرأة والاختلاف، وتحوّل الجدار إلى مساحة تعبّر عنك بأسلوب غير تقليدي.

[offer]⏰ متوفرة بعدد محدود وبحسب الطلب[/offer]

[cta]🛒 صمّم لوحة WANTED الخاصة بك الآن — ودع الجدار يحمل توقيعك.[/cta]`,
        price: 449,
        images: [
            "images/wnt/20251113_132609_5.jpg",
            "images/wnt/1763028681911.jpg",
            "images/wnt/1763028160175.jpg",
            "images/wnt/1763028542652.png"
            ,
            "images/wnt/1763028917109.jpg",
            "images/cdr/all3.png"
        ],
        tag: "جديد",
        category: "MIRROR",
        details: "خصصها كما تريد ",
        specifications: [
            { name: "المادة", value: "   vinyls / 2×frx " },
            { name: "الحجم", value: "85 × 60 سم" },
            { name: "الإطار", value:  "بدون / مخصص"},
            { name: "الوزن", value: " 400~1200غ" },
            { name: "الوقت المتوقع للتوصيل", value: "3-5 أيام عمل" },
            { name: "الضمان", value: " سنة" }
        ],
        // إضافة خيارات التخصيص
        sizes: [
            { id: "s1", name: "صغير ( 42×30سم)", price: 0 },
            { id: "s2", name: "متوسط (80×112 سم)", price: 200 }
        ],
        frames: [
            { 
                id: "f1", 
                name: "بدون إطار", 
                price: 0,
                thumbnail: "images/frames/no-frame.jpg"
            },
            { 
                id: "f2", 
                name: "إطار خشبب", 
                price: 60,
                thumbnail: "images/c/wood.jpeg"
            },
            { 
                id: "f3", 
                name: "إطار المنيوم ذهبي", 
                price: 150,
                thumbnail: "images/c/alm.jpeg"
            }
        ],
        addons: [
            { id: "a1", name: "توقيع البراند", price: 0, selected: false },
            { id: "a2", name: "شهادة أصالة", price: 50, selected: false },
            { id: "a3", name: " / مخصص تغليف فاخر", price: 150, selected: false }
        ]
    },
    {
        id: 4,
        name: " SIMPSON × AUDI",
        description: `  التناسق الذي يدمج بين الرسوم و المحركات الألمانية  يمكن تسميته ببساطة [em1]  الاستثناء لي بغا الحـــــــــال🥶🔥 [/em1]

تجمع لوحة The Simpsons × Audi بين عالم الرسوم الكرتونية الأيقوني The Simpsons وأناقة سيارة AUDI RS6 في تصميم فني متقن يخطف الأنظار من النظرة الأولى. العمل يوازن باحتراف بين الطابع المرح واللمسة الفاخرة، ليقدّم قطعة تناسب مختلف الأعمار والمساحات.

تم تنفيذ اللوحة بطباعة عالية الجودة ودقة متناهية، مع عناية واضحة بالتفاصيل التي تبرز شخصية السيارة وقوة حضورها، دون أن تفقد روح التصميم الكرتوني. كما تتيح إمكانية تخصيص لوحة ترقيم السيارة، ما يحوّل العمل إلى قطعة شخصية وحصرية تعكس الذوق والتميّز.

[title]🔥 لماذا The Simpsons × Audi :[/title] 
[feature]دمج ذكي[/feature]: توازن مدروس بين عالم الكرتون والأداء الرياضي الفاخر. 
[feature]إمكانية التخصيص[/feature]: تخصيص لوحة الترقيم أو التفاصيل حسب رغبتك. 
[feature]جودة تنفيذ عالية[/feature]: مطبوعة على خامات [em2]Premium[/em2] تضمن وضوح الألوان وثباتها. 
[feature]طابع مرح راقٍ[/feature]: مناسبة للأطفال بأسلوبها الكرتوني، وللكبار بلمستها الأنيقة. 
[feature]مرونة في الاستخدام[/feature]: مثالية لغرف الأطفال، المكاتب، الصالات، أو كهدية مميزة.

[em3]💎 أكثر من لوحة[/em3]
The Simpsons × Audi ليست مجرد عمل فني، بل [em4]قطعة تعبّر عن شخصية[/em4] تجمع بين حب السيارات، روح المرح، والذوق العصري.

[offer]⏰ إصدار محدود وقابل للتخصيص حسب الطلب[/offer]

[cta]🛒 أضف The Simpsons × Audi إلى مساحتك الآن — ودع المرح يلتقي بالأداء.[/cta]`,
        price: 469,
        images: [
            "images/crtn/simpson/smps.jpg",
            "images/crtn/simpson/1763070295988.jpg",
            "images/crtn/simpson/1763070330332.jpg",
            "images/crtn/simpson/1763070267962.jpg",
            "images/crtn/simpson/1763070452718.jpg",
            "images/cdr/all3.png"
        ],
        category: "CARTOON",
        categories:["CARTOON","AUDI"],
        details: `تجمع لوحة The Simpsons × Audi بين عالم الرسوم الكرتونية الأيقوني The Simpsons وأناقة سيارة AUDI RS6 في تصميم فني متقن يخطف الأنظار من النظرة الأولى. العمل يوازن باحتراف بين الطابع المرح واللمسة الفاخرة، ليقدّم قطعة تناسب مختلف الأعمار والمساحات.
`,
        specifications: [
            { name: "المادة", value: "   vn / fx / اختياري " },
            { name: "الحجم", value: "70 × 50 سم" },
            { name: "الإطار", value: "بدون / اختياري " },
            { name: "الوزن", value: "300~1200غ" },
            { name: "الوقت المتوقع للتوصيل", value: "2-4 أيام عمل" }
        ],
        // إضافة خيارات التخصيص
        sizes: [
            { id: "s1", name: "متوسط (80×60 سم)", price: 0 },
            { id: "s2", name: "كبير (120×90 سم)", price: 200 }
        ],
        frames: [
            { 
                id: "f1", 
                name: "بدون إطار", 
                price: 0
            },
            { 
                id: "f2", 
                name: "إطار خشبي", 
                price: 80,
                thumbnail: "images/c/wood.jpeg"
            },
            { 
                id: "f3", 
                name: "إطار المنيوم ذهبي", 
                price: 150,
                thumbnail: "images/c/alm.jpeg"
            }
        ],
        addons: [
            { id: "a1", name: "توقيع البراند", price: 0, selected: false },
            { id: "a2", name: "شهادة أصالة", price: 50, selected: false },
            { id: "a3", name: "تغليف فاخر / مخصص", price: 150, selected: false }
        ]
    },
    {
        id: 5,
        name: "Maybach SL680",
        description: `حضور بصري صامت، تُجسّده مقدّمة Maybach بلمسات ذهبية راقية تعكس معنى الترف دون استعراض. عمل فني يوازن بين القوة والنعومة، ويحوّل التفاصيل الهندسية إلى عنصر جمالي متكامل.

التكوين يعتمد على خطوط نظيفة وتباين مدروس، حيث تبرز اللمسات الذهبية كعنصر تركيز أنيق يضيف عمقًا وفخامة هادئة. هذه القطعة صُممت لتكون نقطة جذب راقية تُكمل المساحة بدل أن تفرض نفسها عليها.

[title]🔥 لماذا MAYBACH SL680 :[/title] 
[feature]فخامة مجردة[/feature]: تعبير بصري عن الترف الهادئ بأسلوب معاصر. 
[feature]توازن مثالي[/feature]: انسجام بين القوة البصرية والنعومة التصميمية. 
[feature]لمسات ذهبية دقيقة[/feature]: إبراز محسوب يضيف قيمة دون مبالغة. 
[feature]تنفيذ فاخر[/feature]: مطبوعة على خامات [em2]Premium عالية الجودة[/em2] مع عناية فائقة بالتفاصيل. 
[feature]انسجام معماري[/feature]: مثالية للمساحات العصرية، المكاتب التنفيذية، والديكورات الراقية.

[em3]💎 بيان ذوق[/em3]
MAYBACH SL680 ليست قطعة للعرض فقط، بل [em4]اختيار يعكس هوية[/em4] تقدّر الهدوء، الدقة، والفخامة التي لا تحتاج إلى شرح.

[offer]⏰ إصدار محدود[/offer]

[cta]🛒 أضف MAYBACH  SL680 إلى مساحتك الآن — ودع التفاصيل تتكفّل بالباقي.[/cta]`,
        price: 495,
        images: [
            "images/crs/mrcds/20251114_022024_7.jpg",
            "images/crs/mrcds/1762784949945.png",
            "images/crs/mrcds/1762784957175.png",
            "images/crs/mrcds/1762784963082.png",
            "images/cdr/all3.png"
        ],
        tag: "حصري",
        category: "MERCEDES",
        details: `حضور بصري صامت، تُجسّده مقدّمة Maybach بلمسات ذهبية راقية تعكس معنى الترف دون استعراض. عمل فني يوازن بين القوة والنعومة، ويحوّل التفاصيل الهندسية إلى عنصر جمالي متكامل.`,
        specifications: [
            { name: "المادة", value: "vn/fx / اختياري" },
            { name: "الحجم", value: "80 × 60 سم" },
            { name: "الإطار", value: " بدون / اختياري" },
            { name: "الوزن", value: "200 ~ 1200 غ" },
            { name: "الوقت المتوقع للتوصيل", value: "2-4 أيام عمل" },
            { name: "الضمان", value: " سنة" }
        ],
        // إضافة خيارات التخصيص
        sizes: [
            { id: "s1", name: "صغير (60×40 سم)", price: 0 },
            { id: "s2", name: "متوسط (95 ×75 سم)", price: 150 },
            { id: "s3", name: "كبير (120×90 سم)", price: 200 }
        ],
        frames: [
            { 
                id: "f1", 
                name: "بدون إطار", 
                price: 0
            },
            { 
                id: "f2", 
                name: "إطار خشبي", 
                price: 80,
                thumbnail: "images/c/wood.jpeg"
            },
            { 
                id: "f3", 
                name: "إطار المنيوم ذهبي", 
                price: 160,
                thumbnail: "images/c/alm.jpeg"
            }
        ],
        addons: [
            { id: "a1", name: "توقيع البراند", price: 0, selected: false },
            { id: "a2", name: "شهادة أصالة", price: 50, selected: false },
            { id: "a3", name: "تغليف فاخر", price: 180, selected: false }
        ]
    },
    {
        id: 6,
        name: "BMW M4 Competition",
        description: `خط جانبي نظيف، حضور رياضي واضح، وأناقة لا تحتاج إلى تفسير. تجسّد هذه اللوحة سيارة BMW M4 Competition المكشوفة في عرض جانبي متوازن يبرز قوة التصميم ودقة النسب بأسلوب هادئ واحترافي.

العمل يركّز على التفاصيل الأساسية: الخطوط الانسيابية، الوضعية الرياضية، العجلات السوداء، ولمسات الأداء التي تميّز نسخة Competition. الخلفية البيضاء النظيفة تمنح السيارة مساحة للتنفس بصريًا، بينما يضيف الإطار الأسود لمسة عرض فني تشبه صالات المعارض الراقية.

[title]🔥 لماذا BMW M4 Competition Convertible :[/title] 
[feature]تصميم جانبي أيقوني[/feature]: إبراز واضح لشخصية السيارة الرياضية دون تشويش. 
[feature]حضور متوازن[/feature]: لوحة تضيف قوة بصرية للمكان بدون مبالغة. 
[feature]أسلوب عصري نظيف[/feature]: مثالية للديكورات الحديثة والمساحات البسيطة. 
[feature]تشطيب احترافي[/feature]: مطبوعة على خامات [em2]Premium عالية الجودة[/em2] مع إطار أنيق جاهز للتعليق. 
[feature]مرونة في العرض[/feature]: مناسبة لغرف المعيشة، المكاتب، صالات العرض، أو الكراجات الفاخرة.

[em3]💎 أكثر من صورة سيارة[/em3]
هذه اللوحة ليست استعراضًا للسرعة، بل [em4]تقدير للتصميم والأداء[/em4]. اختيار مثالي لمن يرى في السيارات فنًا هندسيًا قبل أن تكون مجرد وسيلة.

[offer]⏰ كمية محدودة متوفرة[/offer]

[cta]🛒 أضفها إلى مساحتك الآن — ودع الخطوط تتحدث عن الذوق.[/cta]`,
        price: 465,
        images: [
            "images/crs/bmw/20251122_102533_9.jpg",
            "images/crs/bmw/1763543805339.jpg",
            "images/crs/bmw/1763543809832.jpg",
            "images/crs/bmw/1763543814120.jpg",
            "images/crs/bmw/1763543818117.jpg",
            "images/cdr/all3.png"
        ],
        category: "BMW",
        details: "M4 مكشوفة ",
        specifications: [
            { name: "المادة", value: "   فوركس / قماش / اختياري " },
            { name: "الحجم", value: "70 × 30 سم" },
            { name: "الإطار", value: "أحمر جذاب" },
            { name: "الوزن", value: "200~1300غ" },
            { name: "الوقت المتوقع للتوصيل", value: "2-7 أيام عمل" },
            { name: "الضمان", value: "سنة" }
        ],
        // إضافة خيارات التخصيص
        sizes: [
            { id: "s1", name: "متوسط (90×38.5 سم)", price: 150 },
            { id: "s2", name: "كبير (120×51 سم)", price: 250 }
        ],
        frames: [
            { 
           id: "f1", 
           name: "بدون إطار", 
           price: 0
            },
            { 
           id: "f2", 
           name: "إطار خشبي", 
           price: 90,
           thumbnail: "images/c/wood.jpeg"
            },
            { 
          id: "f3", 
          name: "إطار المنيوم ", 
          price: 180,
          thumbnail: "images/c/alm.jpeg"
            }
        ],
        addons: [
  { id: "a1", name: "توقيع البراند", price: 0, selected: false },
  { id: "a2", name: "شهادة أصالة", price: 50, selected: false },
  { id: "a3", name: "تغليف فاخر / مخصص", price: 150, selected: false }
]
}, 
        {
        id: 7,
        name: " Aurum Gear Clock",
        description: `أضف لمسة فاخرة إلى جدارك مع Aυɾυɱ Gҽαɾ Cʅσƈƙ، ساعة الحائط التي ترفع مستوى الديكور من وظيفي إلى تحفة فنية ميكانيكية.
        
        بتصميمها المعدني الذهبي الراقي، تنسجم الساعة بسلاسة بين الحداثة وعبقرية الهندسة الدقيقة، حيث تتحول التروس الزخرفية داخلها إلى عرض مبهر يخطف الأنظار في أي مساحة.

[title]✨ لماذا تختار ساعة Aurum Gear؟[/title]

[feature]إطار ذهبي لامع[/feature]: مصقول بدقة ليعكس الإضاءة ويضيف توهجًا أنيقًا.
[feature]عرض ميكانيكي ساحر[/feature]: تروس داخلية زخرفية تخلق عمقًا بصريًا ديناميكيًا وجذابًا.
[feature]صنعة استثنائية[/feature]: مصنوعة من [em2]خامات عالية الجودة[/em2] مختارة بعناية لضمان المتانة والصلابة لسنوات.
[feature]صمت مطبق[/feature]: حركة عقارب سلسة وهادئة تمامًا، تحافظ على هدوء وسكينة محيطك.
[feature]تحوّل ديكوري كامل[/feature]: تتناغم مع الديكورات المودرن والكلاسيكية الفاخرة، وتصبح القطعة المركزية في غرفة الجلوس، المكتب، صالة الاستقبال، أو القصور.

[em3]💎 تحفة على الحائط[/em3]
هذه ليست مجرد أداة لقراءة الوقت، بل هي [em4]بيان للذوق الرفيع[/em4] وتقدير للجمال الوظيفي. إنها للشخص الذي يبحث عن التميز في أدق التفاصيل.

[offer]⏰ 10 قطع متبقية فقط    [/offer]

[cta]🛍 استمتع بالتجربة الكاملة – علّق الفخامة على جدارك اليوم[/cta]`,
        price: 650,
        images: [
            "clock/1764859928550.png",
            "clock/1764859935978.png",
            "clock/1764859944888.png",
            "clock/1764859953668.png"
        ],
        tag: "جديد",
        category: "CLOCK",
        details: `أضف لمسة فاخرة إلى جدارك مع Aυɾυɱ Gҽαɾ Cʅσƈƙ، ساعة الحائط التي ترفع مستوى الديكور من وظيفي إلى تحفة فنية ميكانيكية.
        
        بتصميمها المعدني الذهبي الراقي، تنسجم الساعة بسلاسة بين الحداثة وعبقرية الهندسة الدقيقة، حيث تتحول التروس الزخرفية داخلها إلى عرض مبهر يخطف الأنظار في أي مساحة.
        `,
        specifications: [
            { name: "الحجم", value: "70 × 70" },
            { name: "العقارب", value: "2" },
            { name: "الوزن", value: "600 ~ 1600 غ" },
            { name: "الوقت المتوقع للتوصيل", value: "2-4 أيام عمل" },
            { name: "الضمان", value: " سنة" }
        ],
    // إضافة خيارات التخصيص
    sizes: [
    ],
    frames: [
    ],
        addons: [
            { id: "a2", name: "شهادة أصالة", price: 50, selected: false },
            { id: "a3", name: " / هدية تغليف فاخر", price: 280, selected: false }
        ]
    },
    
{
    id: 8,
    name: "Eternal Landscape",
    description: "لوحة فنية فاخرة بعنوان ETERNAL LANDSCAPE – [em1]أفق لا ينتهي… وهدوء يُسكن الروح[/em1]\n\nحوّل مساحتك إلى نافذة مفتوحة على عالم أبدي من السكينة والاتساع مع لوحة  ETERNAL LANDSCAPE. عمل فني يأسر النظر منذ اللحظة الأولى، حيث تتعانق الجبال الشامخة مع السهول الخضراء تحت سماء حالمة، في مشهد يمنح إحساسًا عميقًا بالحرية والطمأنينة.\n\nهذه اللوحة ليست مرتبطة بمكان، بل بحالة شعورية. استلهام من طبيعة خالدة لا تعرف حدودًا، مصمّمة بعناية لتمنح مساحتك توازنًا بصريًا وأناقة هادئة تدوم مع الزمن. كل لون، كل خط، وكل عمق بصري وُضع ليخلق تجربة تأملية تشعر بها قبل أن تراها.\n\n[title]🌿 تجربة بصرية خالدة:[/title] \n[feature]هدوء بصري فوري[/feature]: تمنح المكان طاقة إيجابية وإحساسًا بالاتساع والراحة.\n[feature]جمال أبدي[/feature]: تصميم يتجاوز الصيحات، صالح لكل زمان وكل مساحة.\n[feature]تناغم لوني راقٍ[/feature]: مزيج مدروس من الأزرق السماوي والأخضر الطبيعي يبعث السكينة.\n[feature]تشطيب فاخر[/feature]: مطبوعة على خامات [em2]عالية الجودة[/em2] تُبرز العمق والتفاصيل بوضوح استثنائي.\n[feature]حضور أنيق[/feature]: مثالية لغرف المعيشة، المكاتب، والمساحات العصرية والمينيمال.\n\n[em3]💎 أكثر من لوحة[/em3]\nETERNAL LANDSCAPE  ليست مجرد ديكور، بل [em4]تجربة شعورية[/em4]. اختيار لمن يقدّر الجمال الهادئ، ويؤمن أن الفخامة الحقيقية تكمن في البساطة والانسجام.\n\n[offer]⏰ قطعة مميزة بكمية محدودة[/offer]\n\n[cta]🛒 أضف ETERNAL LANDSCAPE إلى مجموعتك الآن — ودع الجدار يفتح أفقًا جديدًا في مساحتك.[/cta]",
    price: 379,
    images: [
        "./nature/1767812664095.png",
        "./nature/1767812642302.png",
        "./nature/1767812680138.png",
        "nature/eternallandscape.jpg",
        "./nature/1767812697832.png",
        "images/cdr/all3.png"
    ],
    tag: "محدود",
    category: "NATURE",
    details: "لوحة فنية تأخذك إلى عالم خارج حدود الزمان والمكان، حيث تلتقي الجبال الشامخة بالسهول الخضراء في مشهد يعكس السكينة والاتساع الأبدي.\nألوانها المتناغمة بين الأزرق السماوي والأخضر الطبيعي تمنح إحساسًا بالراحة والصفاء، وتحوّل أي مساحة إلى ملاذ بصري يبعث على التأمل والهدوء.\nEternal Landscape ليست مجرد لوحة جدارية، بل نافذة مفتوحة على حلمٍ دائم، تضيف عمقًا وأناقة راقية لغرفة المعيشة، المكتب، أو أي مساحة تبحث عن لمسة فنية متوازنة وفخمة.",
    specifications: [
        { name: "المادة", value: "قماش كانفس فني" },
        { name: "الحجم", value: "93 / 63 سم" },
        { name: "الألوان", value: "ألوان زاهية مقاومة للبهتان" },
        { name: "الوزن", value: "400-1200 غ" },
        { name: "وقت التصنيع", value: "2-3 أيام عمل" }
    ],
    sizes: [
        { id: "s_1767919959042_ga5c39c1f", name: "صغير ( 93/63 سم )", price: 0 }
    ],
    frames: [
        { 
            id: "f_1767919959042_a7rvpu550", 
            name: "اطار خشبي", 
            price: 0,
            thumbnail: "images/c/wood.jpeg"
        }
    ],
    addons: [
        { id: "a_1767919959042_u0aka4vrs", name: "توقيع البراند", price: 0, selected: false },
        { id: "a_1767919959042_frzmfkamk", name: "شهادة أصالة", price: 20, selected: false }
    ]
},


{
    id: 9,
    name: "SOVEREIGN |",
    description:  `لوحة فنية فاخرة بعنوان SOVEREIGN – [em1]سيادة الصمت وقوة الحضور[/em1]\n\nحوّل مساحتك إلى بيانٍ بصري يعكس الهيبة، التوازن، والوقار مع لوحة SOVEREIGN . عمل فني يجسّد القوة الهادئة في أبهى صورها، حيث يقف الفارس الأسود في انسجام تام بين السيطرة والحركة، في مشهد يفرض احترامه دون ضجيج.\n\nتستمد اللوحة روحها من اللمسات المغربية العميقة، ممزوجة بأناقة معاصرة تجعلها قطعة خالدة تتجاوز الزمن والموضة. كل تفصيل صُمم ليحكي قصة السيادة التي لا تُعلن… بل تُحس.\n\n[title]🔥 لماذا   SOVEREIGN :[/title] \n[feature]حضور قوي[/feature]: لوحة تُشع ثقة وهيبة، وتغيّر طاقة المكان فورًا. \n[feature]رمزية عميقة[/feature]: تعبير بصري عن القيادة، الانضباط، والسيطرة الهادئة.\n[feature]لمسة مغربية راقية[/feature]: تراث مُضمَر يظهر في الوقار والتكوين العام.\n[feature]تشطيب فاخر[/feature]: مطبوعة على خامات [em2]عالية الجودة[/em2] تبرز العمق والتفاصيل بدقة.\n[feature]قطعة لافتة[/feature]: مثالية للمكاتب التنفيذية، الصالونات الراقية، والمساحات ذات الهوية القوية.\n\n[em3]💎 أكثر من لوحة[/em3]\nSOVEREIGN ليست مجرد عنصر ديكور، بل [em4]تعبير عن شخصية[/em4]. اختيار لمن يؤمن أن القوة الحقيقية هادئة، وأن السيادة لا تحتاج إلى استعراض.\n\n[offer]⏰ قطعة مميزة بكمية محدودة[/offer]\n\n[cta]🛒 أضف SOVEREIGN إلى مجموعتك الآن — ودع الجدار يتحدث عنك.[/cta]`,
    price: 489,
    images: [
        "images/khyl/sv4.jpg",
        "images/khyl/sv1.png",
        "images/khyl/sv2.jpg",
        "images/khyl/sv3.jpeg",
        "images/khyl/sv5.png",
        "images/cdr/all3.png",
    ],
    tag: "",
    category: "HORSES",
    details: `"ليست مجرد لوحة فنية، بل تجسيد للسيادة في أنقى صورها.
    
    
قوة صامتة، حركة متزنة، وحضور يفرض احترامه دون حاجة إلى استعراض. في هذه القطعة، يتجلّى الفارس الأسود كرمز للهيبة والانضباط، حيث يلتقي التوازن الجسدي بالسيطرة الذهنية في مشهد واحد شديد الصفاء.

تحمل SOVEREIGN روحًا مغربية خفية تنعكس في التفاصيل الدقيقة والوقار العام للعمل، مزيج راقٍ بين التراث والفخامة المعاصرة. كل عنصر في اللوحة مدروس بعناية ليخلق إحساسًا بالثبات والسمو، وكأن الزمن قد توقّف احترامًا لهذه اللحظة.
هذه اللوحة خُلقت للمساحات التي لا تبحث عن الزينة، بل عن الهوية. للمكاتب الراقية، الصالونات الهادئة، والأماكن التي تعبّر عن شخصية قوية وواثقة.

SOVEREIGN لا تملأ فراغًا على الجدار، بل تضيف معنى… وتترك أثرًا يدوم."`,
    specifications: [
        { name: "المادة", value: "فينيل / فوركس / اختياري" },
        { name: "الحجم", value: "متوسط (75×50 سم)" },
        { name: "الإطار", value: "بدون / مخصص" },
        { name: "الوزن", value: "300-1500 غ" },
        { name: "وقت التصنيع", value: "2-4 أيام عمل" },
        { name: "وقت التوصيل", value: "2-7 أيام عمل" },
        { name: "الضمان", value: "سنة واحدة" }
    ],
    sizes: [
        { id: "s_1767315877419_8c71yb1jj", name: "متوسط (70×50 سم)", price: 0 },
        { id: "s_1767315877419_wfs1ngj2b", name: "كبير (90×60 سم)", price: 120 },
        { id: "s_1767315877419_rs7audra7", name: "ضخم ( 1×1.5 سم)", price: 200 }
    ],
    frames: [
        { 
            id: "f_1767315877419_7fa9behhe", 
            name: "بدون إطار", 
            price: 0
        },
        { 
            id: "f_1767315877419_pt9kl876l", 
            name: "إطار خشبي", 
            price: 90,
            thumbnail: "images/c/wood.png"
        },
        { 
            id: "f_1767315877419_43fsn0c6l", 
            name: "إطار ألمنيوم", 
            price: 160,
            thumbnail: "images/c/alm.png"
        }
    ],
    addons: [
        { id: "a_1767315877419_p7ur213tn", name: "توقيع البراند", price: 0, selected: false },
        { id: "a_1767315877419_iuqsdcwfq", name: "شهادة أصالة ورقية ممهورة", price: 50, selected: false },
        { id: "a_1767315877419_kzvh7ho9o", name: "تغليف فاخر هدايا", price: 120, selected: false }
    ]
},
      
{
    id: 10,
    name: "Hermes Jokey Style",
    description: "لوحة فنية فاخرة بعنوان HERMES HORSE STYLE – [em1]أناقة السيطرة وقوة التوازن[/em1]\n\nحوّل مساحتك إلى تعبير بصري عن الذوق الرفيع مع لوحة HERMES HORSE STYLE. عمل فني يجمع بين القوة المنضبطة والأناقة الكلاسيكية، حيث يظهر الحصان الأسود في حركة مدروسة، يقوده فارس يعكس الثقة والتحكم دون مبالغة.\n\nيعتمد التكوين على تباين محسوب بين الأسود العميق والخلفية البرتقالية الجريئة، ما يمنح اللوحة حضورًا واضحًا دون صخب، ويجعلها قطعة تلفت الانتباه بأسلوب راقٍ ومتزن. كل عنصر في هذا العمل خُصص ليخدم فكرة واحدة: الفخامة تبدأ من الانضباط.\n\n[title]🔥 لماذا HERMES HORSE STYLE :[/title] \n[feature]حضور متوازن[/feature]: لوحة تضيف قوة بصرية واضحة دون أن تهيمن على المساحة. \n[feature]رمزية مدروسة[/feature]: تعبير عن القيادة، التحكم، والثقة الهادئة. \n[feature]طابع فاخر[/feature]: مستوحاة من عالم الأناقة الكلاسيكية بأسلوب معاصر. \n[feature]تشطيب احترافي[/feature]: مطبوعة على خامات [em2]عالية الجودة[/em2] تُبرز الألوان والتفاصيل بدقة. \n[feature]مرونة في الاستخدام[/feature]: مناسبة للمكاتب التنفيذية، غرف المعيشة العصرية، والمساحات ذات الطابع الراقي.\n\n[em3]💎 أكثر من قطعة فنية[/em3]\nHERMES HORSE STYLE ليست مجرد لوحة، بل [em4]اختيار يعكس شخصية[/em4]. مثالية لمن يقدّر القوة الصامتة، ويؤمن أن الذوق الحقيقي لا يحتاج إلى تبرير.\n\n[offer]⏰ إصدار محدود[/offer]\n\n[cta]🛒 أضف HERMES HORSE STYLE إلى مجموعتك الآن — ودع التفاصيل تعبّر عنك.[/cta]",
    price: 399,
    images: [
        "images/khyl/hrms1.jpg",
        "images/khyl/hrms2.png",
        "images/khyl/hrms3.png",
        "images/khyl/hrms4.png",
        "images/khyl/hrms5.png",
        "images/cdr/all3.png"
    ],
    tag: "",
    category: "HORSES",
    details: "لوحة فنية مستوحاة من عالم الفخامة الهادئة، حيث يلتقي الانضباط، التوازن، والحضور القوي في تكوين بصري نظيف ومدروس. يظهر الحصان الأسود بحركة محسوبة تعكس القوة المضبوطة، بينما يمنح الفارس الكلاسيكي العمل طابعًا راقيًا يوحي بالتحكم والثقة.",
    specifications: [
        { name: "الحجم", value: "متوسط  ( 75×50 سم)" },
        { name: "الإطار", value: "بدون / مخصص" },
        { name: "الوزن", value: "300-1500 غ" },
        { name: "وقت التصنيع", value: "2-4 أيام عمل" },
        { name: "وقت التوصيل", value: "2-7 أيام عمل" },
        { name: "الضمان", value: "سنة واحدة" }
    ],
    sizes: [
        { id: "s_1768004319422_cqws2w8p1", name: "متوسط (75×50 سم)", price: 0 },
        { id: "s_1768004319422_oxcmy7r68", name: "كبير (105×70 سم)", price: 90 },
        { id: "s_1768004319422_0ahlpqefk", name: "ضخم (100×150 سم)", price: 220 }
    ],
    frames: [
        { 
            id: "f_1768004319422_c242xp1ck", 
            name: "اطار خشبي", 
            price: 75,
            thumbnail: "images/c/wood.jpeg"
        },
        { 
            id: "f_1768004319422_gdhypr09h", 
            name: "اطار ألمنيوم", 
            price: 120,
            thumbnail: "images/c/alm.jpeg"
        },
        { 
            id: "f_1768004319422_j7fg0hlnt", 
            name: "بدون إطار", 
            price: 0
        }
    ],
    addons: [
        { id: "a_1768004319422_xoxzlypy6", name: "توقيع البراند", price: 0, selected: false },
        { id: "a_1768004319422_7mj5crh74", name: "شهادة أصالة ورقية ممهورة", price: 50, selected: false },
        { id: "a_1768004319422_gpm3bzeqx", name: "تغليف فاخر هدايا", price: 120, selected: false }
    ]
},
  
{
    id: 11,
    name: "THE SILENT PAIR",
    description: "لوحة فنية فاخرة بعنوان THE SILENT PAIR – [em1]تناغم بلا صوت[/em1]\n\nتقدّم لوحة THE SILENT PAIR رؤية بصرية عن التفاهم العميق الذي لا يحتاج إلى تفسير. حصانان متجاوران، مختلفان في اللون، موحَّدان برباط واحد، في تكوين يعكس الثقة المتبادلة والسيطرة الهادئة بعيدًا عن الضجيج.\n\nالخلفية الغنية المستوحاة من الزخارف الشرقية تضيف عمقًا ثقافيًا وحضورًا بصريًا دافئًا، بينما يشكّل الرباط الأحمر عنصر توازن مركزي يرمز إلى الرابط غير المرئي بين قوتين مستقلتين. العمل مصمم بعناية ليحافظ على توازن التفاصيل دون تشويش، ويمنح العين تجربة هادئة وقوية في آن واحد.\n\n[title]🔥 لماذا THE SILENT PAIR :[/title] \n[feature]فكرة ناضجة[/feature]: تعبير بصري عن الثقة، الشراكة، والانسجام الصامت. \n[feature]تباين متوازن[/feature]: الأبيض والأسود في حوار بصري راقٍ دون تضاد حاد. \n[feature]هوية ثقافية[/feature]: خلفية مستوحاة من الزخارف الكلاسيكية تمنح اللوحة طابعًا خالدًا. \n[feature]تشطيب احترافي[/feature]: مطبوعة على خامات [em2]عالية الجودة[/em2] تُبرز الملمس والعمق بدقة. \n[feature]قطعة ذات معنى[/feature]: مناسبة للمساحات التي تبحث عن هوية، عمق، وحضور فني متزن.\n\n[em3]💎 أكثر من لوحة[/em3]\nTHE SILENT PAIR ليست مجرد عمل فني، بل [em4]تجسيد لفكرة[/em4]: القوة لا تكون في السيطرة الظاهرة، بل في التفاهم العميق الذي لا يُرى… ويُحس.\n\n[offer]⏰ إصدار محدود[/offer]\n\n[cta]🛒 أضف THE SILENT PAIR إلى مجموعتك الآن — ودع الصمت يتحدث عنك.[/cta]",
    price: 469,
    images: [
        "images/khyl/tspr.png",
        "images/khyl/tspr1.png",
        "images/khyl/tspr2.png",
        "images/khyl/tspr3.png",
        "images/khyl/tspr4.png",
        "images/cdr/all3.png"
    ],
    tag: "حصري",
    category: "HORSES",
    details: "تقدّم لوحة THE SILENT PAIR رؤية بصرية عن التفاهم العميق الذي لا يحتاج إلى تفسير. حصانان متجاوران، مختلفان في اللون، موحَّدان برباط واحد، في تكوين يعكس الثقة المتبادلة والسيطرة الهادئة بعيدًا عن الضجيج.",
    specifications: [
        { name: "الحجم", value: "متوسط  ( 40×70 سم)" },
        { name: "الإطار", value: "بدون / مخصص" },
        { name: "الوزن", value: "300-1500 غ" },
        { name: "وقت التصنيع", value: "2-4 أيام عمل" },
        { name: "وقت التوصيل", value: "2-7 أيام عمل" }
    ],
    sizes: [
        { id: "s_1768005709784_lkwnrb5zi", name: "متوسط (40×70 سم)", price: 0 },
        { id: "s_1768005709784_ovk1lb3j5", name: "كبير (60×105 سم)", price: 90 },
        { id: "s_1768005709784_8mx5aqbgh", name: "ضخم (100×177 سم)", price: 270 }
    ],
    frames: [
        { 
            id: "f_1768005709784_8taoqpcx7", 
            name: "بدون إطار", 
            price: 0
        },
        { 
            id: "f_1768005709784_p6osgy13x", 
            name: "اطار خشبي", 
            price: 90,
            thumbnail: "images/c/wood.jpeg"
        },
        { 
            id: "f_1768005709784_4ifg5v5sq", 
            name: "اطار المنيوم", 
            price: 130,
            thumbnail: "images/c/alm.jpeg"
        }
    ],
    addons: [
        { id: "a_1768005709784_v4bsobzmq", name: "توقيع البراند", price: 0, selected: false },
        { id: "a_1768005709784_hir2otreh", name: "شهادة أصالة ورقية ممهورة", price: 50, selected: false },
        { id: "a_1768005709784_x6m89ifgr", name: "تغليف فاخر هدايا", price: 120, selected: false },
        { id: "a_1768005709784_s69c1nlyk", name: "رسالة مكتوبة يدويا", price: 25, selected: false },
        { id: "a_1768005709784_4go3av0w1", name: "إضافة وردة حقيقية", price: 35, selected: false }
    ]
},

    
/*12*/
{
     id: 12,
     name: "Lions era - morocco",
     description: `حضور ملكي، تفاصيل ذهبية مدروسة، وهوية بصرية تعكس لحظة تاريخية بكل فخامة. عمل فني يقدّم رؤية راقية للإنجاز الرياضي عندما يتحوّل إلى رمز للأناقة والقوة.

يجسّد Lions Era روح الفخامة الرياضية من خلال تكوين بصري متوازن يسلّط الضوء على نجوم المنتخب المغربي ببدلات رسمية أنيقة، تتكامل مع اللمسات الذهبية وكرة القدم الذهبية التي يحملها القائد أشرف حكيمي، كرمز للإنجاز، القيادة، والانتصار. الخلفية المعمارية الراقية تضيف عمقًا ملكيًا وتجعل اللوحة أقرب إلى قطعة معروضة في صالة نخبوية.

[title]✨ لماذا Lions Era :[/title] 
[feature]تصميم ملكي راقٍ[/feature]: مزيج متقن بين الفن الرياضي والفخامة البصرية. 
[feature]تفاصيل ذهبية دقيقة[/feature]: رمزية واضحة للإنجاز، التميز، والريادة. 
[feature]تشطيب احترافي[/feature]: مطبوعة على خامات [em2]عالية الجودة[/em2] تبرز الألوان والتفاصيل بدقة. 
[feature]قيمة رمزية عالية[/feature]: عمل فني يجسّد الفخر الوطني ويُلهم الشغف. 
[feature]مرونة في العرض[/feature]: مثالية لغرف المعيشة، المكاتب، صالات الاستقبال، والمساحات الراقية.

[em3]💎 أكثر من مجرد لوحة[/em3]
Lions Era ليست عنصر ديكور فقط، بل [em4]بيان بصري[/em4] يجمع بين الهوية الوطنية، الذوق الرفيع، والفخامة المعمارية في قطعة واحدة.

[offer]⏰ إصدار محدود[/offer]

[cta]🛒 أضف لوحة Lions Era إلى مساحتك الآن — ودع الفخامة تحكي قصة الإنجاز.[/cta]`,
    price: 479,
    images: [
     "images/ftbl/irlns.jpg",
     "images/ftbl/irlns1.png",
     "images/ftbl/irlns2.png",
     "images/ftbl/irlns3.png",
     "images/ftbl/irlns4.png",
     "images/cdr/all3.png"
     ],
     tag: "جديد",
     category: "FOOTBALL",
     details: "إطار من الفخامة الملكية، تفاصيل ذهبية متلألئة، وحضور أيقوني يفرض نفسه بقوة.",
     specifications: [
     { name: "المادة", value: "فينيل / فوركس / اختياري" },
     { name: "الحجم", value: "متوسط (70×50 سم)" },
     { name: "الإطار", value: "بدون / مخصص" },
     { name: "الوزن", value: "300-1500 غ" },
     { name: "وقت التصنيع", value: "2-4 أيام عمل" },
     { name: "وقت التوصيل", value: "2-7 أيام عمل" },
     { name: "الضمان", value: "سنة واحدة" }
     ],
     sizes: [
     { id: "s_1768055601423_ijmj2wktr", name: "متوسط (70×50 سم)", price: 0 },
     { id: "s_1768055601423_mry24eyju", name: "كبير (90×67 سم)", price: 95 },
     { id: "s_1768055601423_qhd3hdfol", name: "ضخم (120×90 سم)", price: 200 }
     ],
     frames: [
         { 
     id: "f_1768055601423_d33iv8iiy", 
     name: "بدون إطار", 
     price: 0
     },
     { 
     id: "f_1768055601423_gwof8q4dw", 
     name: "إطار خشبي", 
     price: 95,
     thumbnail: "images/c/wood.jpeg"
},
    { 
    id: "f_1768055601423_fx538qiiq", 
    name: "إطار ألمنيوم", 
    price: 120,
    thumbnail: "images/c/alm.jpeg"
    },
   
    ],
    addons: [
    { id: "a_1768055601423_3i9c4qh8y", name: "شهادة أصالة", price: 50, selected: false },
    { id: "a_1768055601423_cao5gjtwy", name: "إضافة وردة طبيعية", price: 25, selected: false },
    { id: "a_1768055601423_lm7zpsnym", name: "رسالة مكتوبة يدويا", price: 25, selected: false }
    ]
},

  /*13*/
{
    id: 13,
    name: "Gate of Glory",
    description: `وقفة عز، ألوان وطنية نابضة، وتكوين بصري يجسد روح \"أسود الأطلس\" بكل شموخ. عمل فني يقدّم رؤية ملحمية للإنجاز الرياضي عندما يلتقي الفن الكلاسيكي بحماس المستطيل الأخضر.\n\nتجسّد هذه التحفة روح الفخر المغربي من خلال تكوين متوازن يجمع نجوم المنتخب بقمصانهم الأيقونية، يتوسطهم أشرف حكيمي وبونو بنظرات ملؤها العزيمة والثقة. الخلفية المعمارية ذات الطابع المغربي الأصيل، مؤطرة بلمسات ذهبية عتيقة، تمنح العمل عمقاً تاريخياً وتجعل اللوحة أقرب إلى مقتنيات القصور والمعارض الراقية.\n\n[title]✨ لماذا هذه التحفة الفنية :[/title] \n[feature]تصميم ملحمي خالد[/feature]: دمج احترافي بين واقعية الرسم الديجيتال وفخامة الطابع الكلاسيكي (Vintage). \n[feature]ألوان وطنية غنية[/feature]: تدرجات الأخضر والأحمر تعكس الهوية، الانتماء، والروح القتالية. \n[feature]تشطيب فاخر[/feature]: مطبوعة بدقة متناهية على خامات [em2]عالية الجودة[/em2] تبرز أدق تفاصيل الملامح والأزياء. \n[feature]قيمة معنوية عالية[/feature]: عمل فني يوثق الجيل الذهبي ويُلهم الطموح والنجاح. \n[feature]حضور قوي[/feature]: مثالية لتزين المجالس الفخمة، المكاتب الشخصية، وغرف الشباب العصرية.\n\n[em3]💎 أكثر من مجرد صورة[/em3]\nهذه اللوحة ليست ديكوراً عابراً، بل [em4]وثيقة بصرية[/em4] تجمع بين عشق كرة القدم، الهوية الوطنية، والرقي الفني في إطار واحد.\n\n[offer]🔥 إصدار حصري ومحدود[/offer]\n\n[cta]🛒 اطلب لوحتك الآن — واجعل جدرانك تنبض بروح الانتصار والفخر.[/cta]`,
    price: 479,
    images: [
        "images/ftbl/gtog.png",
        "images/ftbl/gtog1.png",
        "images/ftbl/gtog2.png",
        "images/ftbl/gtog3.png",
        "images/ftbl/gtog4.png",
        "images/cdr/all3.png"
    ],
    tag: "جديد",
    category: "FOOTBALL",
    details: "وقفة عز، ألوان وطنية نابضة، وتكوين بصري يجسد روح \"أسود الأطلس\" بكل شموخ. عمل فني يقدّم رؤية ملحمية للإنجاز الرياضي عندما يلتقي الفن الكلاسيكي بحماس المستطيل الأخضر.",
    specifications: [
        { name: "المادة", value: "قماش كانفس فني" },
        { name: "الحجم", value: "60×40 سم / اختياري" },
        { name: "التقنية", value: "طباعة جيكلي عالية الدقة" },
        { name: "الألوان", value: "ألوان زاهية مقاومة للبهتان" },
        { name: "الوزن", value: "400-1200 غ" },
        { name: "وقت التصنيع", value: "2-3 أيام عمل" }
    ],
    sizes: [
        { id: "s_1768074173066_of1isufcc", name: "صغير (65×45 سم)", price: 0 },
        { id: "s_1768074173066_jmdwkkjoc", name: "متوسط (80×60 سم)", price: 75 },
        { id: "s_1768074173066_xprgqzblo", name: "كبير (100×70 سم)", price: 149 }
    ],
    frames: [
        { 
            id: "f_1768074173066_fzpkqzavu", 
            name: "بدون إطار", 
            price: 0
        },
        { 
            id: "f_1768074173066_np8611f0j", 
            name: "اطار خشبي", 
            price: 65,
            thumbnail: "images/c/wood.jpeg"
        },
        { 
            id: "f_1768074173066_yjfyesvlj", 
            name: "اطار المنيوم", 
            price: 120,
            thumbnail: "images/c/alm.jpeg"
        }
    ],
    addons: [
        { id: "a_1768074173066_gs9kazpf3", name: "توقيع البراند", price: 0, selected: false },
        { id: "a_1768074173066_116qgmhgx", name: "شهادة أصالة ورقية ممهورة", price: 50, selected: false },
        { id: "a_1768074173066_kzq1n3i8e", name: "تغليف فاخر هدايا", price: 120, selected: false },
        { id: "a_1768074173066_wkjd824uz", name: "رسالة ورقية بخط اليد", price: 35, selected: false }
    ]
},

  /*15*/
{
    id: 15,
    name: "Purple Stealth",
    description: `أناقة \"أودي\" تلتقي بشقاوة \"سيمبسون\" في مشهد ليلي ساحر تحت أضواء النيون. عمل فني فريد يكسر القواعد ويجمع بين فخامة السيارات الرياضية وأيقونات الكرتون العالمية بأسلوب الـ Cyberpunk الجذاب.\n\nتجسّد هذه اللوحة سيارة Audi RS6 بنفسجية معدلة بالكامل، تتألق بجنوط ذهبية وإضاءة نيون تعكس بريق مدينة \"سبرينغفيلد\" الليلية، بينما يضفي حضور هومر ومارج سيمبسون لمسة من المرح والتميز. إنها ليست مجرد لوحة، بل هي قطعة \"ستايل\" تعبر عن شخصية جريئة، محبة للسيارات، وتقدّر الفن غير التقليدي.\n\n[title]✨ لماذا Purple Stealth :[/title] \n[feature]مزيج أيقوني نادر[/feature]: دمج احترافي بين عالم السيارات الواقعي وعالم الأنيميشن الشهير. \n[feature]ألوان نيون ليلية[/feature]: تباين مذهل بين البنفسجي العميق، الذهبي، وأضواء النيون الوردية يضيء زوايا غرفتك. \n[feature]تفاصيل عشاق السيارات[/feature]: إبراز ملامح التعديل الرياضي (Widebody kit) بدقة فنية عالية. \n[feature]قطعة محادثة مثالية[/feature]: تضمن جذب انتباه كل من يراها وتفتح باب النقاش حول التميز والإبداع. \n[feature]جودة بصرية سينمائية[/feature]: تصميم يحاكي بوسترات الأفلام الحديثة مع تشطيب احترافي يحمي الألوان من البهتان.\n\n[em3]🌌 لمسة الـ Night Life في مساحتك[/em3]\nPurple Stealth هي [em4]البيان البصري الأقوى[/em4] لكل من يبحث عن التميز بعيداً عن الديكورات التقليدية المملة.\n\n[offer]💎 حصرية لهواة التميز[/offer]\n\n[cta]🛒 أضف روح \"سبرينغفيلد\" العصرية إلى غرفتك — اطلب لوحتك الآن.[/cta]`,
    price: 449,
    images: [
        "images/crtn/plst.png",
        "images/crtn/plst1.png",
        "images/crtn/plst2.png",
        "images/crtn/plst3.png",
        "images/crtn/plst4.png",
        "images/cdr/all3.png"
    ],
    tag: "",
    category: "CARTOON",
    categories:["CARTOON","AUDI"],
    details: "تجسّد هذه اللوحة سيارة Audi RS6 بنفسجية معدلة بالكامل، تتألق بجنوط ذهبية وإضاءة نيون تعكس بريق مدينة \"سبرينغفيلد\" الليلية، بينما يضفي حضور هومر ومارج سيمبسون لمسة من المرح والتميز. إنها ليست مجرد لوحة، بل هي قطعة \"ستايل\" تعبر عن شخصية جريئة، محبة للسيارات، وتقدّر الفن غير التقليدي.",
    specifications: [
        { name: "المادة", value: "فينيل / فوركس / اختياري" },
        { name: "الحجم", value: "متوسط (70×40 سم)" },
        { name: "الإطار", value: "بدون / مخصص" },
        { name: "الوزن", value: "300-1500 غ" },
        { name: "وقت التوصيل", value: "2-7 أيام عمل" },
        { name: "الضمان", value: "سنة واحدة" }
    ],
    sizes: [
        { id: "s_1768083840037_4g1d1wkca", name: "صغير (70×40 سم)", price: 0 },
        { id: "s_1768083840037_xcfo7x9ta", name: "متوسط (80×60 سم)", price: 75 },
        { id: "s_1768083840037_kd1fs5mps", name: "كبير (100×80 سم)", price: 149 }
    ],
    frames: [
        { 
            id: "f_1768083840037_7tiijzxo5", 
            name: "بدون إطار", 
            price: 0
        },
        { 
            id: "f_1768083840037_zeixa6e3z", 
            name: "اطار خشبي", 
            price: 65,
            thumbnail: "images/c/wood.jpeg"
        },
        { 
            id: "f_1768083840037_5x554xd2b", 
            name: "اطار المنيوم", 
            price: 120,
            thumbnail: "images/c/alm.jpeg"
        }
    ],
    addons: [
        { id: "a_1768083840037_urqo0w2dy", name: "توقيع البراند", price: 0, selected: false },
        { id: "a_1768083840037_6ckrw2pnt", name: "شهادة أصالة ورقية ممهورة", price: 50, selected: false },
        { id: "a_1768083840037_5edo3dwk5", name: "تغليف فاخر هدايا", price: 120, selected: false },
        { id: "a_1768083840037_v2qlnsop2", name: "رسالة ورقية بخط اليد", price: 35, selected: false }
    ]
},

  /*16*/
{
    id: 16,
    name: "McQueen: The Real Speed",
    description: `هدير المحركات، وهج الغروب، والأسطورة التي لا تتوقف عن الإبهار. عمل فني يعيد صياغة \"لايتنينغ مكوين\" برؤية سينمائية واقعية تجمع بين سحر الطفولة وهوس السرعة، ليحول جدارك إلى حلبة سباق عالمية.\n\nتجسّد لوحة McQueen: The Real Speed لحظة خاطفة للأنفاس على مضمار السباق، حيث يظهر البرق الأحمر بتفاصيل مذهلة تعكس لمعان الهيكل المعدني ودخان الإطارات المشتعلة تحت سماء قرمزية مهيبة. إنها القطعة المثالية لمن يؤمنون بأن السرعة ليست مجرد أرقام، بل هي أسلوب حياة.\n\n[title]✨ لماذا McQueen: The Real Speed :[/title] \n[feature]واقعية سينمائية فائقة[/feature]: تصميم يبتعد عن الرسوم التقليدية ليقدم \"مكوين\" كسيارة سباق حقيقية نابضة بالحياة. \n[feature]ألوان درامية ملهمة[/feature]: تباين الأحمر الناري مع ألوان الغروب يمنح الغرفة طاقة وحيوية لا تقاوم. \n[feature]عنصر إلهام للأجيال[/feature]: قطعة تربط بين ذكريات الطفولة وشغف التميز والوصول للمركز الأول. \n[feature]لمسة فنية للمساحات الشخصية[/feature]: إضافة مذهلة لغرف الشباب، استوديوهات التصميم، أو حتى مكاتب العمل التي تقدر الإبداع. \n[feature]جودة صُنعت لتدوم[/feature]: مطبوعة بتقنيات تضمن ثبات الألوان وحدة التفاصيل مهما طال الزمن.\n\n[em3]🏁 أكثر من مجرد بطل كرتوني[/em3]\nMcQueen: The Real Speed هي [em4]تجسيد لروح الإصرار[/em4] والسرعة، مصممة خصيصاً لأولئك الذين لا يرضون بغير الصدارة مكاناً.\n\n[offer]🔴 إصدار خاص لعشاق السباقات[/offer]\n\n[cta]🛒 أطلق العنان للسرعة في مساحتك — اطلب لوحتك الآن وانضم لخط البداية.[/cta]`,
    price: 449,
    images: [
        "images/crtn/mcqn.png",
        "images/crtn/mcqn1.png",
        "images/crtn/mcqn2.png",
        "images/crtn/mcqn3.png",
        "images/crtn/mcqn4.png",
        "images/cdr/all3.png"
    ],
    tag: "",
    category: "CARTOON",
    details: "هدير المحركات، وهج الغروب، والأسطورة التي لا تتوقف عن الإبهار. عمل فني يعيد صياغة \"لايتنينغ مكوين\" برؤية سينمائية واقعية تجمع بين سحر الطفولة وهوس السرعة، ليحول جدارك إلى حلبة سباق عالمية.\n\nتجسّد لوحة McQueen: The Real Speed لحظة خاطفة للأنفاس على مضمار السباق، حيث يظهر البرق الأحمر بتفاصيل مذهلة تعكس لمعان الهيكل المعدني ودخان الإطارات المشتعلة تحت سماء قرمزية مهيبة. إنها القطعة المثالية لمن يؤمنون بأن السرعة ليست مجرد أرقام، بل هي أسلوب حياة.",
    specifications: [
        { name: "المادة", value: "قماش فني عالي الجودة" },
        { name: "الحجم", value: "متوسط (70×40 سم)" },
        { name: "التشطيب", value: "طباعة UV مقاومة للماء" },
        { name: "الألوان", value: "ألوان زيتية دقيقة" },
        { name: "الوزن", value: "300-2000 غ" },
        { name: "الضمان", value: "سنة" }
    ],
    sizes: [
        { id: "s_1768091718551_wfvi9trub", name: "متوسط (70×40 سم)", price: 0 },
        { id: "s_1768091718551_qk27p5jht", name: "كبير (105×60 سم)", price: 129 },
        { id: "s_1768091718551_uk080ghp7", name: "ضخم (140×80 سم)", price: 200 }
    ],
    frames: [
        { 
            id: "f_1768091718551_rylnpemud", 
            name: "بدون إطار", 
            price: 0
        },
        { 
            id: "f_1768091718551_1as06ztk2", 
            name: "إطار خشبي", 
            price: 75,
            thumbnail: "images/c/wood.jpeg"
        },
        { 
            id: "f_1768091718551_7dzjsq1me", 
            name: "اطار المنيوم", 
            price: 129,
            thumbnail: "images/c/alm.jpeg"
        }
    ],
    addons: [
        { id: "a_1768091718551_qgpxbhsvb", name: "توقيع البراند", price: 0, selected: false },
        { id: "a_1768091718551_dzdcz51co", name: "شهادة أصالة ورقية ممهورة", price: 50, selected: false },
        { id: "a_1768091718551_0ih6dq1hq", name: "تغليف فاخر هدايا", price: 120, selected: false }
    ]
},

   /*17*/
{
    id: 17,
    name: "Pink power : Porsche cayenne",
    description: `تجرئي على الاختلاف، واجمعي بين رقة اللون وقوة المحرك. عمل فني يكسر النمطية ويقدم سيارة porsche cayenne برؤية فنية \"وردية\" جريئة، مستوحاة من عالم السباقات redbull بلمسة أنثوية فاخرة.\n\nتجسّد لوحة Pink Power التوازن المثالي بين النعومة والصلابة، حيث تبرز السيارة بلونها الوردي الصارخ وشعار الثيران المتناطحة الذي يرمز للقوة والطاقة الجامحة. بخلفيتها الوردية الموحدة وتصميمها المستوحى من فن الملصقات الحديث، تعتبر هذه القطعة إضافة عصرية ومنعشة تضفي حيوية فورية على أي مساحة توضع فيها.\n\n[title]✨ لماذا Pink Power :[/title] \n[feature]تصميم أنثوي جريء[/feature]: مزيج فريد بين فخامة السيارات الرياضية واللون الوردي العصري. \n[feature]رمزية القوة (Red Bull Style)[/feature]: استعارة بصرية ذكية تمنح اللوحة طابع الحماس والمغامرة. \n[feature]أسلوب الـ Flat Art الحديث[/feature]: تصميم بسيط (Minimalist) وأنيق يتناسب مع الديكورات المودرن والبيضاء. \n[feature]هدية مثالية ومميزة[/feature]: الخيار الأروع لمن يبحث عن هدية غير تقليدية تعبر عن الشخصية القوية والمحبة للجمال. \n[feature]ألوان حيوية مستدامة[/feature]: طباعة احترافية تضمن بقاء اللون الوردي مشرقاً وجذاباً لسنوات طويلة.\n\n[em3]🎀 القوة لم تكن يوماً بهذه الرقة[/em3]\nPink Power ليست مجرد لوحة سيارة، بل هي [em4]إعلان عن التميز[/em4] وحب الحياة والانطلاق بكل ثقة.\n\n[offer]💖 إصدار خاص لمحبي التميّز[/offer]\n\n[cta]🛒 اجعلي مساحتك تنبض بالحيوية — اطلبي لوحة Pink Power الآن.[/cta]`,
    price: 429,
    images: [
        "images/crs/prch/pppc.png",
        "images/crs/prch/pppc1.png",
        "images/crs/prch/pppc2.png",
        "images/crs/prch/pppc3.png",
        "images/crs/prch/pppc4.png",
        "images/cdr/all3.png"
    ],
    tag: "",
    category: "PORSCHE",
    details: "تجرئي على الاختلاف، واجمعي بين رقة اللون وقوة المحرك. عمل فني يكسر النمطية ويقدم سيارة porsche cayenne برؤية فنية \"وردية\" جريئة، مستوحاة من عالم السباقات redbull بلمسة أنثوية فاخرة.",
    specifications: [
        { name: "المادة", value: "قماش فني عالي الجودة" },
        { name: "الحجم", value: "متوسط (60×40 سم)" },
        { name: "التشطيب", value: "طباعة UV مقاومة للماء" },
        { name: "الألوان", value: "ألوان زيتية دقيقة" },
        { name: "الوزن", value: "300-2000 غ" },
        { name: "الضمان", value: "سنة" }
    ],
    sizes: [
        { id: "s_1768092834686_hrlw9pr3c", name: "متوسط (60×40 سم)", price: 0 },
        { id: "s_1768092834686_gxi3amq49", name: "كبير (90×60 سم)", price: 129 },
        { id: "s_1768092834686_e23v9rfsn", name: "ضخم (120×80 سم)", price: 180 }
    ],
    frames: [
        { 
            id: "f_1768092834686_naphpmu2b", 
            name: "بدون إطار", 
            price: 0
        },
        { 
            id: "f_1768092834686_bh81qm0mk", 
            name: "إطار خشبي", 
            price: 75,
            thumbnail: "images/c/wood.jpeg"
        },
        { 
            id: "f_1768092834686_tchiiw89h", 
            name: "اطار المنيوم", 
            price: 129,
            thumbnail: "images/c/alm.jpeg"
        }
    ],
    addons: [
        { id: "a_1768092834686_x5mk8p4f2", name: "توقيع البراند", price: 0, selected: false },
        { id: "a_1768092834686_nw70aa0q9", name: "شهادة أصالة ورقية ممهورة", price: 50, selected: false },
        { id: "a_1768092834686_vvum65ndk", name: "تغليف فاخر هدايا", price: 120, selected: false },
        { id: "a_1768092834686_omgijg7gx", name: "إظافة وردة طبيعية 🌹", price: 25, selected: false },
        { id: "a_1768092834686_8udqoe75d", name: "رسالة بخط اليد", price: 25, selected: false }
    ]
},

  /*18*/
{
    id: 18,
    name: "Bmw M3 Gtr",
    description: `هيبة الأساطير، بصمة التحدي، والسيارة التي طاردت أحلام جيل كامل. عمل فني يعيد إحياء الأسطورة BMW M3 GTR بلمسة واقعية مذهلة، تجسد ملامح السرعة والانتصار على جدران مساحتك الخاصة.\n\nتجسّد لوحة BMW M3 GTR الإثارة الخالصة لسباقات الشوارع، حيث تظهر السيارة بتصميمها الأيقوني وهي مغطاة بآثار الطريق التي تحكي قصة ألف سباق. بخلفيتها الدرامية وتفاصيلها الميكانيكية الدقيقة، تعتبر هذه اللوحة قطعة فنية نادرة لكل من ترعرع على حب المحركات وتحدي المستحيل.\n\n[title]✨ لماذا BMW M3 GTR :[/title] \n[feature]تجسيد للأسطورة الحية[/feature]: احتفاء بأشهر سيارة في تاريخ ألعاب سباقات السيارات بتفاصيل واقعية غير مسبوقة. \n[feature]لمسة الـ \"Vintage Racing\"[/feature]: تأثيرات الغبار والخدوش الفنية تمنح اللوحة عمقاً وقصة تجذب الأنظار. \n[feature]دقة بصرية مذهلة[/feature]: إبراز تفاصيل الهيكل العريض (Widebody) والجنوط الذهبية بدقة سينمائية عالية. \n[feature]مثالية لعشاق الـ Gaming[/feature]: القطعة التي تنقص أي غرفة ألعاب أو مكتب لشخص يقدر الكلاسيكيات الخالدة. \n[feature]خامات فاخرة[/feature]: مطبوعة على خامات [em2]عالية الجودة[/em2] تضمن إبراز التباين اللوني القوي والظلال الدرامية. \n\n[em3]🔥 لا تُقاد.. بل تُقتنى كتحفة[/em3]\nBMW M3 GTR ليست مجرد لوحة سيارة، بل هي [em4]تذكرة عودة[/em4] إلى لحظات الحماس والسرعة التي لا تُنسى.\n\n[offer]🏁 إصدار خاص لعشاق \"الأدرينالين\"[/offer]\n\n[cta]🛒 أعد الأسطورة إلى مكانها الصحيح — اطلب لوحة BMW M3 GTR الآن.[/cta]`,
    price: 429,
    images: [
        "images/crs/bmw/m3gtr.png",
        "images/crs/bmw/m3gtr1.png",
        "images/crs/bmw/m3gtr2.png",
        "images/crs/bmw/m3gtr3.png",
        "images/crs/bmw/m3gtr4.png",
        "images/cdr/all3.png"
    ],
    tag: "",
    category: "BMW",
    details: "هيبة الأساطير، بصمة التحدي، والسيارة التي طاردت أحلام جيل كامل. عمل فني يعيد إحياء الأسطورة BMW M3 GTR بلمسة واقعية مذهلة، تجسد ملامح السرعة والانتصار على جدران مساحتك الخاصة.\n\nتجسّد لوحة BMW M3 GTR الإثارة الخالصة لسباقات الشوارع، حيث تظهر السيارة بتصميمها الأيقوني وهي مغطاة بآثار الطريق التي تحكي قصة ألف سباق. بخلفيتها الدرامية وتفاصيلها الميكانيكية الدقيقة، تعتبر هذه اللوحة قطعة فنية نادرة لكل من ترعرع على حب المحركات وتحدي المستحيل.",
    specifications: [
        { name: "المادة", value: "قماش فني عالي الجودة" },
        { name: "الحجم", value: "متوسط (30×50 سم)" },
        { name: "التشطيب", value: "طباعة UV مقاومة للماء" },
        { name: "الألوان", value: "ألوان زيتية دقيقة" },
        { name: "الوزن", value: "300-2000 غ" },
        { name: "الضمان", value: "سنة" }
    ],
    sizes: [
        { id: "s_1768094325434_w0ansdmnu", name: "صغير (50×30 سم)", price: 0 },
        { id: "s_1768094325434_1i48nj7b0", name: "متوسط (60×35 سم)", price: 50 },
        { id: "s_1768094325434_99jbvehwm", name: "كبير (80×45 سم)", price: 120 }
    ],
    frames: [
        { 
            id: "f_1768094325434_cpgjp0t9z", 
            name: "بدون إطار", 
            price: 0
        },
        { 
            id: "f_1768094325434_thci5qmse", 
            name: "إطار خشبي", 
            price: 75,
            thumbnail: "images/c/wood.jpeg"
        },
        { 
            id: "f_1768094325434_n1on7dgdr", 
            name: "اطار المنيوم", 
            price: 129,
            thumbnail: "images/c/alm.jpeg"
        }
    ],
    addons: [
        { id: "a_1768094325434_utjve99ky", name: "توقيع البراند", price: 0, selected: false },
        { id: "a_1768094325434_gp0vqumg2", name: "شهادة أصالة ورقية ممهورة", price: 50, selected: false },
        { id: "a_1768094325434_jyi6a8hgf", name: "تغليف فاخر هدايا", price: 120, selected: false },
        { id: "a_1768094325434_evrhgdupq", name: "إظافة وردة طبيعية 🌹", price: 25, selected: false },
        { id: "a_1768094325434_c76iawhws", name: "رسالة بخط اليد", price: 25, selected: false }
    ]
},
  
 /*19*/ 
{
    id: 19,
    name: "Porsche 911",
    description: "نقاء التصميم، دقة الخطوط، ومنظور علوي يكشف سحر الهندسة الألمانية بكل وضوح. عمل فني يبتعد عن صخب الخلفيات ليركز على الجمال الخالص لأيقونة السيارات \"بورش\"، حيث يلتقي البياض الناصع بجرأة الأحمر الرياضي.\n\nتجسّد لوحة The Red Line سيارة بورش 911 المكشوفة (Speedster) من زاوية رأسية نادرة، تبرز انسيابية الهيكل وتناسق المقصورة الداخلية الحمراء مع الخطوط الخارجية. بفضل خلفيتها الحمراء العميقة وتصميمها المينيمالي (Minimalist)، تعتبر هذه القطعة إضافة مثالية للمساحات العصرية التي تقدّر الفن البسيط والفخامة غير المتكلفة.\n\n[title]✨ لماذا The Red Line :[/title] \n[feature]زاوية رؤية فنية[/feature]: منظور علوي (Flat Lay) يبرز جمالية التصميم الهندسي للسيارة بعيداً عن الزوايا التقليدية. \n[feature]تناغم لوني فاخر[/feature]: تباين مذهل بين الأبيض اللؤلؤي والأحمر القاني يعطي إحساساً بالنظافة والرقي. \n[feature]تصميم مينيمالي (Minimalist)[/feature]: خالية من التفاصيل المشتتة، مما يجعلها قطعة ديكور هادئة تناسب المكاتب وغرف المعيشة الحديثة. \n[feature]رمزية الأناقة الرياضية[/feature]: تجسيد لروح السيارات المكشوفة التي ترمز للحرية والانطلاق بأناقة. \n[feature]طباعة عالية الوضوح[/feature]: تبرز أدق تفاصيل المقاعد والخطوط الانسيابية بجودة تحاكي التصوير الفوتوغرافي الاحترافي.\n\n[em3]🏎️ الجمال يكمن في البساطة[/em3]\nThe Red Line ليست مجرد صورة لسيارة، بل هي [em4]درس في الأناقة[/em4] وتجسيد لفلسفة \"الأقل هو الأكثر\".\n\n[offer]🔴 قطعة فنية لأصحاب الذوق الرفيع[/offer]\n\n[cta]🛒 أضف لمسة من الرقي الألماني إلى جدارك — اطلب لوحة The Red Line الآن.[/cta]`",
    price: 449,
    images: [
        "images/crs/prch/911red.png",
        "images/crs/prch/911red1.png",
        "images/crs/prch/911red2.png",
        "images/crs/prch/911red3.png",
        "images/crs/prch/911red4.png",
        "images/cdr/all3.png"
    ],
    tag: "",
    category: "PORSCHE",
    details: "نقاء التصميم، دقة الخطوط، ومنظور علوي يكشف سحر الهندسة الألمانية بكل وضوح. عمل فني يبتعد عن صخب الخلفيات ليركز على الجمال الخالص لأيقونة السيارات \"بورش\"، حيث يلتقي البياض الناصع بجرأة الأحمر الرياضي.",
    specifications: [
        { name: "المادة", value: "فينيل / فوركس / اختياري" },
        { name: "الحجم", value: "متوسط (70×50 سم)" },
        { name: "الإطار", value: "بدون / مخصص" },
        { name: "الوزن", value: "300-1500 غ" },
        { name: "وقت التصنيع", value: "2-4 أيام عمل" },
        { name: "وقت التوصيل", value: "2-7 أيام عمل" },
        { name: "الضمان", value: "سنة واحدة" }
    ],
    sizes: [
        { id: "s_1768173525802_340xvdga7", name: "متوسط (70×50 سم)", price: 0 },
        { id: "s_1768173525802_orpu0l2nv", name: "كبير (90×60 سم)", price: 80 },
        { id: "s_1768173525802_ga4bwyqiw", name: "ضخم (120×80 سم)", price: 135 }
    ],
    frames: [
        { 
            id: "f_1768173525802_al7mc1sqw", 
            name: "بدون إطار", 
            price: 0
        },
        { 
            id: "f_1768173525802_p6j1lwbla", 
            name: "اطار خشبي", 
            price: 75,
            thumbnail: "images/c/wood.jpeg"
        },
        { 
            id: "f_1768173525802_qkfopazpa", 
            name: "اطار المنيوم", 
            price: 169,
            thumbnail: "images/c/alm.jpeg"
        }
    ],
    addons: [
        { id: "a_1768173525803_axretnx8b", name: "توقيع البراند", price: 0, selected: false },
        { id: "a_1768173525803_vls4jh230", name: "شهادة أصالة", price: 20, selected: false },
        { id: "a_1768173525803_jptree7vy", name: "Neon led", price: 215, selected: false }
    ]
},



];
